MikroElektronika/core_packages/ARM/gcc_clang/def/renesas/R7FA4L1BD4CNE/mcu.h
 #define R_SYSTEM_VRTLVDCR_LVDE_Pos              (4UL)          /*!< LVDE (Bit 4)                                          */
 #define R_SYSTEM_VRTLVDCR_LVDE_Msk              (0x10UL)       /*!< LVDE (Bitfield-Mask: 0x01)                            */
 #define R_SYSTEM_VRTLVDCR_LVL_Pos               (5UL)          /*!< LVL (Bit 5)                                           */
 #define R_SYSTEM_VRTLVDCR_LVL_Msk               (0xe0UL)       /*!< LVL (Bitfield-Mask: 0x07)                             */
/* =========================================================  VRTSR  ========================================================= */
 #define R_SYSTEM_VRTSR_PORDET_Pos               (0UL)          /*!< PORDET (Bit 0)                                        */
 #define R_SYSTEM_VRTSR_PORDET_Msk               (0x1UL)        /*!< PORDET (Bitfield-Mask: 0x01)                          */
 #define R_SYSTEM_VRTSR_DET_Pos                  (1UL)          /*!< DET (Bit 1)                                           */
 #define R_SYSTEM_VRTSR_DET_Msk                  (0x2UL)        /*!< DET (Bitfield-Mask: 0x01)                             */
 #define R_SYSTEM_VRTSR_VRTVLD_Pos               (4UL)          /*!< VRTVLD (Bit 4)                                        */
 #define R_SYSTEM_VRTSR_VRTVLD_Msk               (0x10UL)       /*!< VRTVLD (Bitfield-Mask: 0x01)                          */
 #define R_SYSTEM_VRTSR_MON_Pos                  (5UL)          /*!< MON (Bit 5)                                           */
 #define R_SYSTEM_VRTSR_MON_Msk                  (0x20UL)       /*!< MON (Bitfield-Mask: 0x01)                             */
/* =======================================================  VRTCMPCR  ======================================================== */
 #define R_SYSTEM_VRTCMPCR_CMPE_Pos              (0UL)          /*!< CMPE (Bit 0)                                          */
 #define R_SYSTEM_VRTCMPCR_CMPE_Msk              (0x1UL)        /*!< CMPE (Bitfield-Mask: 0x01)                            */
/* =======================================================  VRTLVDICR  ======================================================= */
 #define R_SYSTEM_VRTLVDICR_IE_Pos               (0UL)          /*!< IE (Bit 0)                                            */
 #define R_SYSTEM_VRTLVDICR_IE_Msk               (0x1UL)        /*!< IE (Bitfield-Mask: 0x01)                              */
 #define R_SYSTEM_VRTLVDICR_IDTSEL_Pos           (4UL)          /*!< IDTSEL (Bit 4)                                        */
 #define R_SYSTEM_VRTLVDICR_IDTSEL_Msk           (0x30UL)       /*!< IDTSEL (Bitfield-Mask: 0x03)                          */
/* ========================================================  EXLVDCR  ======================================================== */
 #define R_SYSTEM_EXLVDCR_LVDE_Pos               (4UL)          /*!< LVDE (Bit 4)                                          */
 #define R_SYSTEM_EXLVDCR_LVDE_Msk               (0x10UL)       /*!< LVDE (Bitfield-Mask: 0x01)                            */
/* ========================================================  EXLVDSR  ======================================================== */
 #define R_SYSTEM_EXLVDSR_DET_Pos                (1UL)          /*!< DET (Bit 1)                                           */
 #define R_SYSTEM_EXLVDSR_DET_Msk                (0x2UL)        /*!< DET (Bitfield-Mask: 0x01)                             */
 #define R_SYSTEM_EXLVDSR_MON_Pos                (5UL)          /*!< MON (Bit 5)                                           */
 #define R_SYSTEM_EXLVDSR_MON_Msk                (0x20UL)       /*!< MON (Bitfield-Mask: 0x01)                             */
/* ======================================================  EXLVDCMPCR  ======================================================= */
 #define R_SYSTEM_EXLVDCMPCR_CMPE_Pos            (0UL)          /*!< CMPE (Bit 0)                                          */
 #define R_SYSTEM_EXLVDCMPCR_CMPE_Msk            (0x1UL)        /*!< CMPE (Bitfield-Mask: 0x01)                            */
/* =======================================================  EXLVDICR  ======================================================== */
 #define R_SYSTEM_EXLVDICR_IE_Pos                (0UL)          /*!< IE (Bit 0)                                            */
 #define R_SYSTEM_EXLVDICR_IE_Msk                (0x1UL)        /*!< IE (Bitfield-Mask: 0x01)                              */
 #define R_SYSTEM_EXLVDICR_IDTSEL_Pos            (4UL)          /*!< IDTSEL (Bit 4)                                        */
 #define R_SYSTEM_EXLVDICR_IDTSEL_Msk            (0x30UL)       /*!< IDTSEL (Bitfield-Mask: 0x03)                          */

/* =========================================================================================================================== */
/* ================                                           R_TSN                                           ================ */
/* =========================================================================================================================== */

/* =========================================================  TSCDR  ========================================================= */
/* ========================================================  TSCDRH  ========================================================= */
 #define R_TSN_TSCDRH_TSCDRH_Pos    (0UL)    /*!< TSCDRH (Bit 0)                                        */
 #define R_TSN_TSCDRH_TSCDRH_Msk    (0xffUL) /*!< TSCDRH (Bitfield-Mask: 0xff)                          */
/* ========================================================  TSCDRL  ========================================================= */
 #define R_TSN_TSCDRL_TSCDRL_Pos    (0UL)    /*!< TSCDRL (Bit 0)                                        */
 #define R_TSN_TSCDRL_TSCDRL_Msk    (0xffUL) /*!< TSCDRL (Bitfield-Mask: 0xff)                          */
/* ========================================================  TSCDRR  ========================================================= */

/* =========================================================================================================================== */
/* ================                                         R_USB_FS0                                         ================ */
/* =========================================================================================================================== */

